# Дано вещественное число а. Пользуясь только операцией
# умножения, получить:
#     б) a в 6 степени за три операции,
#     в) в 7 степени за четыре операции,
#     ж) в 13 степени за пять операций,
#     к) в 28 степени за шесть операций

a = float(input("Введите число a: "))

# получаем a в 6-ой степени за три операции
a2 = a * a
a4 = a2 * a2
a6 = a4 * a2

print("a в 6-ой степени =", a6)

# получаем a в 7-ой степени за четыре операции
a2 = a * a
a4 = a2 * a2
a6 = a4 * a2 
a7 = a * a6

print("a в 7-ой степени  =", a7)

# получаем a в 13-ой степени за пять операций

a2 = a * a
a4 = a2 * a2
a8 = a4 * a4
a9 = a8 * a
a13 = a9 * a4

print("a в 13-ой степени =", a13)

# получаем a в 21-ой степени за шесть операций

a2 = a * a
a4 = a2 * a2
a6 = a4 * a2
a7 = a6 * a
a14 = a7 * a7
a28 = a14 * a14

print("a в 28-ой степени =", a28)