# Выведите на экран таблицу умножения от 1 до 10. Используя лишь
# одну переменную, которая будет изменять свое значение от 1 до 10
# при умножении на 10.

# Используем одну переменную, которая будет увеличиваться на 1 от 1 до 10
i = 0

print("Таблица умножения от 1 до 10:")

# while i < 10:
#     print(f"1*10={(i+1)*10}")
#     i += 1

print(
    f"1*10={(i + 1) * 10}\n2*10={(i + 2) * 10}\n2*10={(i + 3) * 10}\n2*10={(i + 4) * 10}\n2*10={(i + 5) * 10}\n2*10={(i + 6) * 10}\n2*10={(i + 7) * 10}\n2*10={(i + 8) * 10}\n2*10={(i + 9) * 10}\n2*10={(i + 10) * 10}"
)
