# Составить программу вывода на экран в одну строку трех
# любых чисел с двумя пробелами между ними.

num1 = input("Введите первое число: ")
num2 = input("Введите второе число: ")
num3 = input("Введите третье число: ")

print(num1, num2, num3, sep="  ")