# Дано вещественное число а. Пользуясь только операцией умножения, получить:
#     a в 7 степени за четыре операции,
#     a в 9 степени за четыре операции,
#     a в 13 степени за пять операций,
#     a в 21 степени за шесть операций

a = float(input("Введите число a: "))


# получаем a в 7-ой степени за четыре операции
a2 = a * a
a4 = a2 * a2
a6 = a4 * a2 
a7 = a * a6

print("a в 7-ой степени  =", a7)


# получаем a в 9-ой степени за четыре операции
a2 = a * a
a4 = a2 * a2
a8 = a4 * a4
a9 = a8 * a

print("a в 9-ой степени =", a9)

# получаем a в 13-ой степени за пять операций

a2 = a * a
a4 = a2 * a2
a8 = a4 * a4
a9 = a8 * a
a13 = a9 * a4

print("a в 13-ой степени =", a13)

# получаем a в 21-ой степени за шесть операций

a2 = a * a
a4 = a2 * a2
a8 = a4 * a4
a9 = a8 * a
a13 = a9 * a4
a21 = a13 * a8

print("a в 21-ой степени =", a21)