
# Напишите программу, которая считывает целое положительное
# число x и выводит на экран последовательность чисел x, 2x, 3x,
# 4x, 5x, разделенных тремя черточками.

# Считать целое положительное число
x = int(input("Введите целое положительное число: "))

# Выводим на экран последовательность чисел x, 2x, 3x, 4x, 5x, разделенных тремя черточками
print(x, 2*x, 3*x, 4*x, 5*x, sep="-"*3)







