# Вывести на экран числа 5, 10 и 21 одно под другим используя
# один print.

print(5, 10, 21, sep="\n")