# Даны три целых числа a, b, c. Найдите среднее арифметическое
# этих чисел.

a = int(input("Введите целое число a: "))
b = int(input("Введите целое число b: "))
c = int(input("Введите целое число c: "))

# Вычисляем среднее арифметическое
average = (a + b + c) / 3

print(f"Cреднее арифметическое чисел {a}, {b} и {c} = {average}")

